import React from 'react';
import './SumoZones.block.style.scss';

function SumoZonesBlock(props) {
  return (
    <section className={`sumo-zones-block`}>
      <div className={`sumo-zones-title`}>
        <span>
          Зони змагання
        </span>
      </div>
      <ul className={`sumo-zones-cards-wrapper`}>
        <li className={`sumo-zones-card card1`}>
          Турнір з Сумо автономних роботів проводиться у спеціально відведеній зоні змагань. На її території мають знаходиться тільки учасники змагань, судді та помічники суддів. Тренери, батьки учасників та інші особи в цю зону не допускаються.
        </li>
        <li className={`sumo-zones-card card2`}>
          <div>
            Зона змагань поділяється на 3 частини:
          </div>
          <ul>
            <li>Піт - зони(Зони для підготовки)</li>
            <li>Зона карантину (Зона для перевірки та розміщення роботів)</li>
            <li>Зона проведення матчів.</li>
          </ul>
        </li>
        <li className={`sumo-zones-card card3`}>
          Піт-зони- основна зона перебування учасників змагання, де вони можуть побудувати, змінити конструкцію, налаштування свого робота, запрограмувати та протестувати йогою
        </li>
        <li className={`sumo-zones-card card4`}>
          Зона-карантину – Зона інспекції, де учасники передають суддям своїх роботів на перевірку відповідності останніх вимог змагань(конструктивні, габаритні, вагові) та залишають їх у цій зоні до початку проведення матча.
        </li>
        <li className={`sumo-zones-card card5`}>
          Зона проведення матчів включає поля проведення раундів між двома командами.
        </li>
        <li className={`sumo-zones-card card6`}>
          В зону карантину та в зону проведення матчів учаснику дозволено заходити лише тільки з дозволу суддів чи помічників суддів
        </li>
      </ul>
    </section>
  );
}

export default SumoZonesBlock;